app/controllers/comments_controller.rb

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("content", "commentor_id", "story_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "xdfnbxnfg"], ["commentor_id", 2], ["story_id", 1], ["created_at", "2015-02-03 04:29:57.665754"], ["updated_at", "2015-02-03 04:29:57.665754"]]
---
  def create
    @story = Story.find(params[:story_id])
    @comment = @story.comments.create(comment_params)

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."story_id" = $1 AND "comments"."id" = $2 LIMIT 1  [["story_id", 2], ["id", 12]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 12]]
---
  def destroy
    @story = Story.find(params[:story_id])
    @comment = @story.comments.find(params[:id])
    @comment.destroy