app/controllers/stories_controller.rb

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @story = Story.find(params[:id])

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @story = Story.find(params[:id])

INSERT INTO "stories" ("title", "content", "fiction", "user_id", "genre_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "123"], ["content", "123"], ["fiction", "t"], ["user_id", 3], ["genre_id", 3], ["created_at", "2015-02-03 04:27:32.878639"], ["updated_at", "2015-02-03 04:27:32.878639"]]
---
  def create
    @story = Story.new(story_params)

    if @story.save

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "stories" SET "title" = $1, "updated_at" = $2 WHERE "stories"."id" = $3  [["title", "possimuss"], ["updated_at", "2015-02-03 03:41:37.868451"], ["id", 1]]
---
  def update
    @story = Story.find(params[:id])

    if @story.update(story_params)

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT 1  [["id", 18]]
DELETE FROM "stories" WHERE "stories"."id" = $1  [["id", 18]]
---
  def destroy
    @story = Story.find(params[:id])
    @story.destroy